 <div class="row">
        <div class="col-lg-9">
            <h1>602.Friend Requests II: Who Has the Most Friends</h1>
            <div class="markdown-body" style="margin-top: 20px">
                In social network like Facebook or Twitter, people send friend requests and accept others&#39; requests as well.
<p>&nbsp;</p>
Table <code>request_accepted1</code> holds the data of friend acceptance, while <b>requester_id</b> and <b>accepter_id</b> both are the id of a person.

<p>&nbsp;</p>

<pre>
| requester_id | accepter_id | accept_date|
|--------------|-------------|------------|
| 1            | 2           | 2016_06-03 |
| 1            | 3           | 2016-06-08 |
| 2            | 3           | 2016-06-08 |
| 3            | 4           | 2016-06-09 |
</pre>
Write a query to find the the people who has most friends and the most friends number. For the sample data above, the result is:

<pre>
| id | num |
|----|-----|
| 3  | 3   |
</pre>
<b>Note:</b>

<ul>
	<li>It is guaranteed there is only 1 people having the most friends.</li>
	<li>The friend request could only been accepted once, which mean there is no multiple records with the same <b>requester_id</b> and <b>accepter_id</b> value.
	<p>&nbsp;</p>
	<b>Explanation:</b><br />
	The person with id &#39;3&#39; is a friend of people &#39;1&#39;, &#39;2&#39; and &#39;4&#39;, so he has 3 friends in total, which is the most number than any others.
	<p>&nbsp;</p>
	<b>Follow-up:</b><br />
	In the real world, multiple people could have the same most number of friends, can you find all these people in this case?</li>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("request_accepted1", engine)

   requester_id  accepter_id accept_date
0             1            2  2016-06-03
1             1            3  2016-06-08
2             2            3  2016-06-08
3             3            4  2016-06-09

In [6]:
## Method 1: UNION
query = '''
WITH COM AS (
SELECT r.requester_id, r.accepter_id 
FROM request_accepted1 r
UNION ALL 
SELECT s.accepter_id, s.requester_id
FROM request_accepted1 s)
SELECT c.requester_id, COUNT(DISTINCT c.accepter_id) num
FROM COM c
GROUP BY c.requester_id
ORDER BY num DESC LIMIT 1;
'''
pd.read_sql_query(query, engine)

   requester_id  num
0             3    3

In [4]:
## Method 2: Subquery. Under the assumption of unique lines.
query = '''
SELECT r.requester_id id, 
       (SELECT COUNT(*)
       FROM request_accepted1 s
       WHERE r.requester_id = s.accepter_id OR
             r.requester_id = s.requester_id) num
FROM request_accepted1 r
ORDER BY num DESC
LIMIT 1;
;
'''
pd.read_sql_query(query, engine)

   id  num
0   3    3
1   1    2
2   1    2
3   2    2

In [5]:
## Method Followup
query = '''
WITH c as (SELECT r.requester_id id, 
       (SELECT COUNT(*)
       FROM request_accepted1 s
       WHERE r.requester_id = s.accepter_id OR
             r.requester_id = s.requester_id) num
FROM request_accepted1 r)
SELECT *
FROM c cb
WHERE cb.num IN (SELECT MAX(cp.num)
                FROM c cp);
'''
pd.read_sql_query(query, engine)

   id  num
0   3    3

## Note
#### 1. SELECT * FROM [data A] UNION ALL  SELECT * FROM [dataB]  (all data points)
#### 2. Union - unique records of A and B.
#### 3. ORDER xxx DESE LIMIT 1 --> maximum value.
#### 4. WITH dataname as (SELECT....) SELECT * FROM dataname....